
Процедура ЗаполнитьТаблицуРолей() Экспорт
	
	ПользовательСеанса = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	СписокПрав.Очистить();
	
	НаборРолей = Метаданные.Роли;
	Для Каждого ТекРоль Из НаборРолей Цикл
		
		СтрокаРоли = СписокПрав.Добавить();
		СтрокаРоли.ИмяРоли =ТекРоль.Имя;
		СтрокаРоли.ПредставлениеРоли = ТекРоль.Синоним;
		СтрокаРоли.Включено = ПользовательСеанса.Роли.Содержит(ТекРоль);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ПользовательСеанса = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	Если НЕ (ПользовательСеанса = Неопределено) Тогда
		НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользовательИБ.Имя = Наименование;
		НовыйПользовательИБ.ПолноеИмя = ПолноеИмяПользователя;
		
	КонецЕсли;
	 
	 ПользовательСеанса.Роли.Очистить();
	 
	 СписокСтрокРолей = СписокПрав.НайтиСтроки(Новый Структура("Включено", Истина));
	 
	 Для Каждого СтрокаРоли Из СписокСтрокРолей Цикл
	 	ПользовательСеанса.Роли.Добавить(Метаданные.Роли.Найти(СтрокаРоли.ИмяРоли));
	 	
	 	
	 	
	 КонецЦикла;
	ПользовательСеанса.Записать();
	
КонецПроцедуры
